package game

/**
    @author: WangYuding
    @since: 2022/4/24
    @desc: //添加字符串常量
**/

const (
	MainLogicStr  = ",欢迎来到提瓦特大陆,请选择功能：1.基础信息 2.背包 3.up池抽卡模拟 4.up池抽卡（消耗相遇之缘） 5.地图 6.私人聊天 7.世界聊天(V1.1) 999.退出客户端"
	BasicLogicStr = "当前处于基础信息界面,请选择操作：0返回1查询信息2设置名字3设置签名4头像5名片6设置生日"
	BagLogicStr   = "当前处于背包界面,请选择操作：0返回1增加物品2扣除物品3使用物品"
	WishLogicStr  = "您现在在抽卡界面 按0返回 按1祈愿1次 按2祈愿10次 按3查询抽卡信息"
	WorldChatStr  = "您可以和在线的玩家进行交流了！退出世界聊天请输入 exit; 请在下方输入聊天内容：  "
	P2PChatStr    = "您可以给离线或者在线的玩家发送信息了！请输入玩家UID"
	WishHint      = "提示：如果祈愿之缘数量不足，请通过背包功能增加祈愿之缘，物品id为1000005"
)
